zephyrproject-rtos/zephyr/ext/hal/cypress/PDL/3.1.0/devices/psoc6/include/ip/cyip_ble.h
/* BLE_BLESS.DDFT_CONFIG */
#define BLE_BLESS_DDFT_CONFIG_DDFT_ENABLE_Pos   0UL
#define BLE_BLESS_DDFT_CONFIG_DDFT_ENABLE_Msk   0x1UL
#define BLE_BLESS_DDFT_CONFIG_BLERD_DDFT_EN_Pos 1UL
#define BLE_BLESS_DDFT_CONFIG_BLERD_DDFT_EN_Msk 0x2UL
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG1_Pos 8UL
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG1_Msk 0x1F00UL
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG2_Pos 16UL
#define BLE_BLESS_DDFT_CONFIG_DDFT_MUX_CFG2_Msk 0x1F0000UL
/* BLE_BLESS.XTAL_CLK_DIV_CONFIG */
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_SYSCLK_DIV_Pos 0UL
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_SYSCLK_DIV_Msk 0x3UL
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_LLCLK_DIV_Pos 2UL
#define BLE_BLESS_XTAL_CLK_DIV_CONFIG_LLCLK_DIV_Msk 0xCUL
/* BLE_BLESS.INTR_STAT */
#define BLE_BLESS_INTR_STAT_DSM_ENTERED_INTR_Pos 0UL
#define BLE_BLESS_INTR_STAT_DSM_ENTERED_INTR_Msk 0x1UL
#define BLE_BLESS_INTR_STAT_DSM_EXITED_INTR_Pos 1UL
#define BLE_BLESS_INTR_STAT_DSM_EXITED_INTR_Msk 0x2UL
#define BLE_BLESS_INTR_STAT_RCBLL_DONE_INTR_Pos 2UL
#define BLE_BLESS_INTR_STAT_RCBLL_DONE_INTR_Msk 0x4UL
#define BLE_BLESS_INTR_STAT_BLERD_ACTIVE_INTR_Pos 3UL
#define BLE_BLESS_INTR_STAT_BLERD_ACTIVE_INTR_Msk 0x8UL
#define BLE_BLESS_INTR_STAT_RCB_INTR_Pos        4UL
#define BLE_BLESS_INTR_STAT_RCB_INTR_Msk        0x10UL
#define BLE_BLESS_INTR_STAT_LL_INTR_Pos         5UL
#define BLE_BLESS_INTR_STAT_LL_INTR_Msk         0x20UL
#define BLE_BLESS_INTR_STAT_GPIO_INTR_Pos       6UL
#define BLE_BLESS_INTR_STAT_GPIO_INTR_Msk       0x40UL
#define BLE_BLESS_INTR_STAT_EFUSE_INTR_Pos      7UL
#define BLE_BLESS_INTR_STAT_EFUSE_INTR_Msk      0x80UL
#define BLE_BLESS_INTR_STAT_XTAL_ON_INTR_Pos    8UL
#define BLE_BLESS_INTR_STAT_XTAL_ON_INTR_Msk    0x100UL
#define BLE_BLESS_INTR_STAT_ENC_INTR_Pos        9UL
#define BLE_BLESS_INTR_STAT_ENC_INTR_Msk        0x200UL
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_POS_Pos 10UL
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_POS_Msk 0x400UL
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_NEG_Pos 11UL
#define BLE_BLESS_INTR_STAT_HVLDO_LV_DETECT_NEG_Msk 0x800UL
/* BLE_BLESS.INTR_MASK */
#define BLE_BLESS_INTR_MASK_DSM_EXIT_Pos        0UL
#define BLE_BLESS_INTR_MASK_DSM_EXIT_Msk        0x1UL
#define BLE_BLESS_INTR_MASK_DSM_ENTERED_INTR_MASK_Pos 1UL
#define BLE_BLESS_INTR_MASK_DSM_ENTERED_INTR_MASK_Msk 0x2UL
#define BLE_BLESS_INTR_MASK_DSM_EXITED_INTR_MASK_Pos 2UL
#define BLE_BLESS_INTR_MASK_DSM_EXITED_INTR_MASK_Msk 0x4UL
#define BLE_BLESS_INTR_MASK_XTAL_ON_INTR_MASK_Pos 3UL
#define BLE_BLESS_INTR_MASK_XTAL_ON_INTR_MASK_Msk 0x8UL
#define BLE_BLESS_INTR_MASK_RCBLL_INTR_MASK_Pos 4UL
#define BLE_BLESS_INTR_MASK_RCBLL_INTR_MASK_Msk 0x10UL
#define BLE_BLESS_INTR_MASK_BLERD_ACTIVE_INTR_MASK_Pos 5UL
#define BLE_BLESS_INTR_MASK_BLERD_ACTIVE_INTR_MASK_Msk 0x20UL
#define BLE_BLESS_INTR_MASK_RCB_INTR_MASK_Pos   6UL
#define BLE_BLESS_INTR_MASK_RCB_INTR_MASK_Msk   0x40UL
#define BLE_BLESS_INTR_MASK_LL_INTR_MASK_Pos    7UL
#define BLE_BLESS_INTR_MASK_LL_INTR_MASK_Msk    0x80UL
#define BLE_BLESS_INTR_MASK_GPIO_INTR_MASK_Pos  8UL
#define BLE_BLESS_INTR_MASK_GPIO_INTR_MASK_Msk  0x100UL
#define BLE_BLESS_INTR_MASK_EFUSE_INTR_MASK_Pos 9UL
#define BLE_BLESS_INTR_MASK_EFUSE_INTR_MASK_Msk 0x200UL
#define BLE_BLESS_INTR_MASK_ENC_INTR_MASK_Pos   10UL
#define BLE_BLESS_INTR_MASK_ENC_INTR_MASK_Msk   0x400UL
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_POS_MASK_Pos 11UL
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_POS_MASK_Msk 0x800UL
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_NEG_MASK_Pos 12UL
#define BLE_BLESS_INTR_MASK_HVLDO_LV_DETECT_NEG_MASK_Msk 0x1000UL
/* BLE_BLESS.LL_CLK_EN */
#define BLE_BLESS_LL_CLK_EN_CLK_EN_Pos          0UL
#define BLE_BLESS_LL_CLK_EN_CLK_EN_Msk          0x1UL
#define BLE_BLESS_LL_CLK_EN_CY_CORREL_EN_Pos    1UL
#define BLE_BLESS_LL_CLK_EN_CY_CORREL_EN_Msk    0x2UL
#define BLE_BLESS_LL_CLK_EN_MXD_IF_OPTION_Pos   2UL
#define BLE_BLESS_LL_CLK_EN_MXD_IF_OPTION_Msk   0x4UL
#define BLE_BLESS_LL_CLK_EN_SEL_RCB_CLK_Pos     3UL
#define BLE_BLESS_LL_CLK_EN_SEL_RCB_CLK_Msk     0x8UL
#define BLE_BLESS_LL_CLK_EN_BLESS_RESET_Pos     4UL
#define BLE_BLESS_LL_CLK_EN_BLESS_RESET_Msk     0x10UL
#define BLE_BLESS_LL_CLK_EN_DPSLP_HWRCB_EN_Pos  5UL
#define BLE_BLESS_LL_CLK_EN_DPSLP_HWRCB_EN_Msk  0x20UL
/* BLE_BLESS.LF_CLK_CTRL */
#define BLE_BLESS_LF_CLK_CTRL_DISABLE_LF_CLK_Pos 0UL
#define BLE_BLESS_LF_CLK_CTRL_DISABLE_LF_CLK_Msk 0x1UL
#define BLE_BLESS_LF_CLK_CTRL_ENABLE_ENC_CLK_Pos 1UL
#define BLE_BLESS_LF_CLK_CTRL_ENABLE_ENC_CLK_Msk 0x2UL
#define BLE_BLESS_LF_CLK_CTRL_M0S8BLESS_REV_ID_Pos 29UL
#define BLE_BLESS_LF_CLK_CTRL_M0S8BLESS_REV_ID_Msk 0xE0000000UL
/* BLE_BLESS.EXT_PA_LNA_CTRL */
#define BLE_BLESS_EXT_PA_LNA_CTRL_ENABLE_EXT_PA_LNA_Pos 1UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_ENABLE_EXT_PA_LNA_Msk 0x2UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_CHIP_EN_POL_Pos 2UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_CHIP_EN_POL_Msk 0x4UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_PA_CTRL_POL_Pos 3UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_PA_CTRL_POL_Msk 0x8UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_LNA_CTRL_POL_Pos 4UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_LNA_CTRL_POL_Msk 0x10UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_OUT_EN_DRIVE_VAL_Pos 5UL
#define BLE_BLESS_EXT_PA_LNA_CTRL_OUT_EN_DRIVE_VAL_Msk 0x20UL
/* BLE_BLESS.LL_PKT_RSSI_CH_ENERGY */
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RSSI_Pos 0UL
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RSSI_Msk 0xFFFFUL
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RX_CHANNEL_Pos 16UL
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_RX_CHANNEL_Msk 0x3F0000UL
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_PKT_RSSI_OR_CH_ENERGY_Pos 22UL
#define BLE_BLESS_LL_PKT_RSSI_CH_ENERGY_PKT_RSSI_OR_CH_ENERGY_Msk 0x400000UL
/* BLE_BLESS.BT_CLOCK_CAPT */
#define BLE_BLESS_BT_CLOCK_CAPT_BT_CLOCK_Pos    0UL
#define BLE_BLESS_BT_CLOCK_CAPT_BT_CLOCK_Msk    0xFFFFUL
/* BLE_BLESS.MT_CFG */
#define BLE_BLESS_MT_CFG_ENABLE_BLERD_Pos       0UL
#define BLE_BLESS_MT_CFG_ENABLE_BLERD_Msk       0x1UL
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXIT_CFG_Pos 1UL
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXIT_CFG_Msk 0x2UL
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXITED_Pos   2UL
#define BLE_BLESS_MT_CFG_DEEPSLEEP_EXITED_Msk   0x4UL
#define BLE_BLESS_MT_CFG_ACT_LDO_NOT_BUCK_Pos   3UL
#define BLE_BLESS_MT_CFG_ACT_LDO_NOT_BUCK_Msk   0x8UL
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_BYPASS_Pos 4UL
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_BYPASS_Msk 0x10UL
#define BLE_BLESS_MT_CFG_HVLDO_BYPASS_Pos       5UL
#define BLE_BLESS_MT_CFG_HVLDO_BYPASS_Msk       0x20UL
#define BLE_BLESS_MT_CFG_OVERRIDE_ACT_REGULATOR_Pos 6UL
#define BLE_BLESS_MT_CFG_OVERRIDE_ACT_REGULATOR_Msk 0x40UL
#define BLE_BLESS_MT_CFG_ACT_REGULATOR_EN_Pos   7UL
#define BLE_BLESS_MT_CFG_ACT_REGULATOR_EN_Msk   0x80UL
#define BLE_BLESS_MT_CFG_OVERRIDE_DIG_REGULATOR_Pos 8UL
#define BLE_BLESS_MT_CFG_OVERRIDE_DIG_REGULATOR_Msk 0x100UL
#define BLE_BLESS_MT_CFG_DIG_REGULATOR_EN_Pos   9UL
#define BLE_BLESS_MT_CFG_DIG_REGULATOR_EN_Msk   0x200UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_SWITCH_Pos 10UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_SWITCH_Msk 0x400UL
#define BLE_BLESS_MT_CFG_RET_SWITCH_Pos         11UL
#define BLE_BLESS_MT_CFG_RET_SWITCH_Msk         0x800UL
#define BLE_BLESS_MT_CFG_OVERRIDE_ISOLATE_Pos   12UL
#define BLE_BLESS_MT_CFG_OVERRIDE_ISOLATE_Msk   0x1000UL
#define BLE_BLESS_MT_CFG_ISOLATE_N_Pos          13UL
#define BLE_BLESS_MT_CFG_ISOLATE_N_Msk          0x2000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_LL_CLK_EN_Pos 14UL
#define BLE_BLESS_MT_CFG_OVERRIDE_LL_CLK_EN_Msk 0x4000UL
#define BLE_BLESS_MT_CFG_LL_CLK_EN_Pos          15UL
#define BLE_BLESS_MT_CFG_LL_CLK_EN_Msk          0x8000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_EN_Pos  16UL
#define BLE_BLESS_MT_CFG_OVERRIDE_HVLDO_EN_Msk  0x10000UL
#define BLE_BLESS_MT_CFG_HVLDO_EN_Pos           17UL
#define BLE_BLESS_MT_CFG_HVLDO_EN_Msk           0x20000UL
#define BLE_BLESS_MT_CFG_DPSLP_ECO_ON_Pos       18UL
#define BLE_BLESS_MT_CFG_DPSLP_ECO_ON_Msk       0x40000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RESET_N_Pos   19UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RESET_N_Msk   0x80000UL
#define BLE_BLESS_MT_CFG_RESET_N_Pos            20UL
#define BLE_BLESS_MT_CFG_RESET_N_Msk            0x100000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_XTAL_EN_Pos   21UL
#define BLE_BLESS_MT_CFG_OVERRIDE_XTAL_EN_Msk   0x200000UL
#define BLE_BLESS_MT_CFG_XTAL_EN_Pos            22UL
#define BLE_BLESS_MT_CFG_XTAL_EN_Msk            0x400000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_CLK_EN_Pos    23UL
#define BLE_BLESS_MT_CFG_OVERRIDE_CLK_EN_Msk    0x800000UL
#define BLE_BLESS_MT_CFG_BLERD_CLK_EN_Pos       24UL
#define BLE_BLESS_MT_CFG_BLERD_CLK_EN_Msk       0x1000000UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_LDO_OL_Pos 25UL
#define BLE_BLESS_MT_CFG_OVERRIDE_RET_LDO_OL_Msk 0x2000000UL
#define BLE_BLESS_MT_CFG_RET_LDO_OL_Pos         26UL
#define BLE_BLESS_MT_CFG_RET_LDO_OL_Msk         0x4000000UL
#define BLE_BLESS_MT_CFG_HVLDO_POR_HV_Pos       27UL
#define BLE_BLESS_MT_CFG_HVLDO_POR_HV_Msk       0x8000000UL
/* BLE_BLESS.MT_DELAY_CFG */
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_STARTUP_DELAY_Pos 0UL
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_STARTUP_DELAY_Msk 0xFFUL
#define BLE_BLESS_MT_DELAY_CFG_ISOLATE_DEASSERT_DELAY_Pos 8UL
#define BLE_BLESS_MT_DELAY_CFG_ISOLATE_DEASSERT_DELAY_Msk 0xFF00UL
#define BLE_BLESS_MT_DELAY_CFG_ACT_TO_SWITCH_DELAY_Pos 16UL
#define BLE_BLESS_MT_DELAY_CFG_ACT_TO_SWITCH_DELAY_Msk 0xFF0000UL
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_DISABLE_DELAY_Pos 24UL
#define BLE_BLESS_MT_DELAY_CFG_HVLDO_DISABLE_DELAY_Msk 0xFF000000UL
/* BLE_BLESS.MT_DELAY_CFG2 */
#define BLE_BLESS_MT_DELAY_CFG2_OSC_STARTUP_DELAY_LF_Pos 0UL
#define BLE_BLESS_MT_DELAY_CFG2_OSC_STARTUP_DELAY_LF_Msk 0xFFUL
#define BLE_BLESS_MT_DELAY_CFG2_DSM_OFFSET_TO_WAKEUP_INSTANT_LF_Pos 8UL
#define BLE_BLESS_MT_DELAY_CFG2_DSM_OFFSET_TO_WAKEUP_INSTANT_LF_Msk 0xFF00UL
#define BLE_BLESS_MT_DELAY_CFG2_ACT_STARTUP_DELAY_Pos 16UL
#define BLE_BLESS_MT_DELAY_CFG2_ACT_STARTUP_DELAY_Msk 0xFF0000UL
#define BLE_BLESS_MT_DELAY_CFG2_DIG_LDO_STARTUP_DELAY_Pos 24UL
#define BLE_BLESS_MT_DELAY_CFG2_DIG_LDO_STARTUP_DELAY_Msk 0xFF000000UL
/* BLE_BLESS.MT_DELAY_CFG3 */
#define BLE_BLESS_MT_DELAY_CFG3_XTAL_DISABLE_DELAY_Pos 0UL
#define BLE_BLESS_MT_DELAY_CFG3_XTAL_DISABLE_DELAY_Msk 0xFFUL
#define BLE_BLESS_MT_DELAY_CFG3_DIG_LDO_DISABLE_DELAY_Pos 8UL
#define BLE_BLESS_MT_DELAY_CFG3_DIG_LDO_DISABLE_DELAY_Msk 0xFF00UL
#define BLE_BLESS_MT_DELAY_CFG3_VDDR_STABLE_DELAY_Pos 16UL
#define BLE_BLESS_MT_DELAY_CFG3_VDDR_STABLE_DELAY_Msk 0xFF0000UL
/* BLE_BLESS.MT_VIO_CTRL */
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_Pos 0UL
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_Msk 0x1UL
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_DLY_Pos 1UL
#define BLE_BLESS_MT_VIO_CTRL_SRSS_SWITCH_EN_DLY_Msk 0x2UL
/* BLE_BLESS.MT_STATUS */
#define BLE_BLESS_MT_STATUS_BLESS_STATE_Pos     0UL
#define BLE_BLESS_MT_STATUS_BLESS_STATE_Msk     0x1UL
#define BLE_BLESS_MT_STATUS_MT_CURR_STATE_Pos   1UL
#define BLE_BLESS_MT_STATUS_MT_CURR_STATE_Msk   0x1EUL
#define BLE_BLESS_MT_STATUS_HVLDO_STARTUP_CURR_STATE_Pos 5UL
#define BLE_BLESS_MT_STATUS_HVLDO_STARTUP_CURR_STATE_Msk 0xE0UL
#define BLE_BLESS_MT_STATUS_LL_CLK_STATE_Pos    8UL
#define BLE_BLESS_MT_STATUS_LL_CLK_STATE_Msk    0x100UL
/* BLE_BLESS.PWR_CTRL_SM_ST */
#define BLE_BLESS_PWR_CTRL_SM_ST_PWR_CTRL_SM_CURR_STATE_Pos 0UL
#define BLE_BLESS_PWR_CTRL_SM_ST_PWR_CTRL_SM_CURR_STATE_Msk 0xFUL
/* BLE_BLESS.HVLDO_CTRL */
#define BLE_BLESS_HVLDO_CTRL_ADFT_EN_Pos        0UL
#define BLE_BLESS_HVLDO_CTRL_ADFT_EN_Msk        0x1UL
#define BLE_BLESS_HVLDO_CTRL_ADFT_CTRL_Pos      1UL
#define BLE_BLESS_HVLDO_CTRL_ADFT_CTRL_Msk      0x1EUL
#define BLE_BLESS_HVLDO_CTRL_VREF_EXT_EN_Pos    6UL
#define BLE_BLESS_HVLDO_CTRL_VREF_EXT_EN_Msk    0x40UL
#define BLE_BLESS_HVLDO_CTRL_STATUS_Pos         31UL
#define BLE_BLESS_HVLDO_CTRL_STATUS_Msk         0x80000000UL
/* BLE_BLESS.MISC_EN_CTRL */
#define BLE_BLESS_MISC_EN_CTRL_BUCK_EN_CTRL_Pos 0UL
#define BLE_BLESS_MISC_EN_CTRL_BUCK_EN_CTRL_Msk 0x1UL
#define BLE_BLESS_MISC_EN_CTRL_ACT_REG_EN_CTRL_Pos 1UL
#define BLE_BLESS_MISC_EN_CTRL_ACT_REG_EN_CTRL_Msk 0x2UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_EN_Pos 2UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_EN_Msk 0x4UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_MULTI_Pos 3UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_DRIFT_MULTI_Msk 0x8UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_ENTRY_CTRL_MODE_Pos 4UL
#define BLE_BLESS_MISC_EN_CTRL_LPM_ENTRY_CTRL_MODE_Msk 0x10UL
/* BLE_BLESS.EFUSE_CONFIG */
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_MODE_Pos   0UL
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_MODE_Msk   0x1UL
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_READ_Pos   1UL
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_READ_Msk   0x2UL
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_WRITE_Pos  2UL
#define BLE_BLESS_EFUSE_CONFIG_EFUSE_WRITE_Msk  0x4UL
/* BLE_BLESS.EFUSE_TIM_CTRL1 */
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_HIGH_Pos 0UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_HIGH_Msk 0xFFUL
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_LOW_Pos  8UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_SCLK_LOW_Msk  0xFF00UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_SETUP_TIME_Pos 16UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_SETUP_TIME_Msk 0xF0000UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_HOLD_TIME_Pos 20UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_CS_SCLK_HOLD_TIME_Msk 0xF00000UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_SETUP_TIME_Pos 24UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_SETUP_TIME_Msk 0xF000000UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_HOLD_TIME_Pos 28UL
#define BLE_BLESS_EFUSE_TIM_CTRL1_RW_CS_HOLD_TIME_Msk 0xF0000000UL
/* BLE_BLESS.EFUSE_TIM_CTRL2 */
#define BLE_BLESS_EFUSE_TIM_CTRL2_DATA_SAMPLE_TIME_Pos 0UL
#define BLE_BLESS_EFUSE_TIM_CTRL2_DATA_SAMPLE_TIME_Msk 0xFFUL
#define BLE_BLESS_EFUSE_TIM_CTRL2_DOUT_CS_HOLD_TIME_Pos 8UL
#define BLE_BLESS_EFUSE_TIM_CTRL2_DOUT_CS_HOLD_TIME_Msk 0xF00UL
/* BLE_BLESS.EFUSE_TIM_CTRL3 */
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_SETUP_TIME_Pos 0UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_SETUP_TIME_Msk 0xFUL
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_HOLD_TIME_Pos 4UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_PGM_SCLK_HOLD_TIME_Msk 0xF0UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_SETUP_TIME_Pos 8UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_SETUP_TIME_Msk 0xFF00UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_HOLD_TIME_Pos 16UL
#define BLE_BLESS_EFUSE_TIM_CTRL3_AVDD_CS_HOLD_TIME_Msk 0xFF0000UL
/* BLE_BLESS.EFUSE_RDATA_L */
#define BLE_BLESS_EFUSE_RDATA_L_DATA_Pos        0UL
#define BLE_BLESS_EFUSE_RDATA_L_DATA_Msk        0xFFFFFFFFUL
/* BLE_BLESS.EFUSE_RDATA_H */
#define BLE_BLESS_EFUSE_RDATA_H_DATA_Pos        0UL
#define BLE_BLESS_EFUSE_RDATA_H_DATA_Msk        0xFFFFFFFFUL
/* BLE_BLESS.EFUSE_WDATA_L */
#define BLE_BLESS_EFUSE_WDATA_L_DATA_Pos        0UL
#define BLE_BLESS_EFUSE_WDATA_L_DATA_Msk        0xFFFFFFFFUL
/* BLE_BLESS.EFUSE_WDATA_H */
#define BLE_BLESS_EFUSE_WDATA_H_DATA_Pos        0UL
#define BLE_BLESS_EFUSE_WDATA_H_DATA_Msk        0xFFFFFFFFUL
/* BLE_BLESS.DIV_BY_625_CFG */
#define BLE_BLESS_DIV_BY_625_CFG_ENABLE_Pos     1UL
#define BLE_BLESS_DIV_BY_625_CFG_ENABLE_Msk     0x2UL
#define BLE_BLESS_DIV_BY_625_CFG_DIVIDEND_Pos   8UL
#define BLE_BLESS_DIV_BY_625_CFG_DIVIDEND_Msk   0xFFFF00UL
/* BLE_BLESS.DIV_BY_625_STS */
#define BLE_BLESS_DIV_BY_625_STS_QUOTIENT_Pos   0UL
#define BLE_BLESS_DIV_BY_625_STS_QUOTIENT_Msk   0x3FUL
#define BLE_BLESS_DIV_BY_625_STS_REMAINDER_Pos  8UL
#define BLE_BLESS_DIV_BY_625_STS_REMAINDER_Msk  0x3FF00UL
/* BLE_BLESS.PACKET_COUNTER0 */
#define BLE_BLESS_PACKET_COUNTER0_PACKET_COUNTER_LOWER_Pos 0UL
#define BLE_BLESS_PACKET_COUNTER0_PACKET_COUNTER_LOWER_Msk 0xFFFFFFFFUL
/* BLE_BLESS.PACKET_COUNTER2 */
#define BLE_BLESS_PACKET_COUNTER2_PACKET_COUNTER_UPPER_Pos 0UL
#define BLE_BLESS_PACKET_COUNTER2_PACKET_COUNTER_UPPER_Msk 0xFFUL
/* BLE_BLESS.IV_MASTER0 */
#define BLE_BLESS_IV_MASTER0_IV_MASTER_Pos      0UL
#define BLE_BLESS_IV_MASTER0_IV_MASTER_Msk      0xFFFFFFFFUL
/* BLE_BLESS.IV_SLAVE0 */
#define BLE_BLESS_IV_SLAVE0_IV_SLAVE_Pos        0UL
#define BLE_BLESS_IV_SLAVE0_IV_SLAVE_Msk        0xFFFFFFFFUL
/* BLE_BLESS.ENC_KEY */
#define BLE_BLESS_ENC_KEY_ENC_KEY_Pos           0UL
#define BLE_BLESS_ENC_KEY_ENC_KEY_Msk           0xFFFFFFFFUL
/* BLE_BLESS.MIC_IN0 */
#define BLE_BLESS_MIC_IN0_MIC_IN_Pos            0UL
#define BLE_BLESS_MIC_IN0_MIC_IN_Msk            0xFFFFFFFFUL
/* BLE_BLESS.MIC_OUT0 */
#define BLE_BLESS_MIC_OUT0_MIC_OUT_Pos          0UL
#define BLE_BLESS_MIC_OUT0_MIC_OUT_Msk          0xFFFFFFFFUL
/* BLE_BLESS.ENC_PARAMS */
#define BLE_BLESS_ENC_PARAMS_DATA_PDU_HEADER_Pos 0UL
#define BLE_BLESS_ENC_PARAMS_DATA_PDU_HEADER_Msk 0x3UL
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_Pos 2UL
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_Msk 0x7CUL
#define BLE_BLESS_ENC_PARAMS_DIRECTION_Pos      7UL
#define BLE_BLESS_ENC_PARAMS_DIRECTION_Msk      0x80UL
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_EXT_Pos 8UL
#define BLE_BLESS_ENC_PARAMS_PAYLOAD_LENGTH_LSB_EXT_Msk 0x700UL
#define BLE_BLESS_ENC_PARAMS_MEM_LATENCY_HIDE_Pos 11UL
#define BLE_BLESS_ENC_PARAMS_MEM_LATENCY_HIDE_Msk 0x800UL
/* BLE_BLESS.ENC_CONFIG */
#define BLE_BLESS_ENC_CONFIG_START_PROC_Pos     0UL
#define BLE_BLESS_ENC_CONFIG_START_PROC_Msk     0x1UL
#define BLE_BLESS_ENC_CONFIG_ECB_CCM_Pos        1UL
#define BLE_BLESS_ENC_CONFIG_ECB_CCM_Msk        0x2UL
#define BLE_BLESS_ENC_CONFIG_DEC_ENC_Pos        2UL
#define BLE_BLESS_ENC_CONFIG_DEC_ENC_Msk        0x4UL
#define BLE_BLESS_ENC_CONFIG_PAYLOAD_LENGTH_MSB_Pos 8UL
#define BLE_BLESS_ENC_CONFIG_PAYLOAD_LENGTH_MSB_Msk 0xFF00UL
#define BLE_BLESS_ENC_CONFIG_B0_FLAGS_Pos       16UL
#define BLE_BLESS_ENC_CONFIG_B0_FLAGS_Msk       0xFF0000UL
#define BLE_BLESS_ENC_CONFIG_AES_B0_DATA_OVERRIDE_Pos 24UL
#define BLE_BLESS_ENC_CONFIG_AES_B0_DATA_OVERRIDE_Msk 0x1000000UL
/* BLE_BLESS.ENC_INTR_EN */
#define BLE_BLESS_ENC_INTR_EN_AUTH_PASS_INTR_EN_Pos 0UL
#define BLE_BLESS_ENC_INTR_EN_AUTH_PASS_INTR_EN_Msk 0x1UL
#define BLE_BLESS_ENC_INTR_EN_ECB_PROC_INTR_EN_Pos 1UL
#define BLE_BLESS_ENC_INTR_EN_ECB_PROC_INTR_EN_Msk 0x2UL
#define BLE_BLESS_ENC_INTR_EN_CCM_PROC_INTR_EN_Pos 2UL
#define BLE_BLESS_ENC_INTR_EN_CCM_PROC_INTR_EN_Msk 0x4UL
/* BLE_BLESS.ENC_INTR */
#define BLE_BLESS_ENC_INTR_AUTH_PASS_INTR_Pos   0UL
#define BLE_BLESS_ENC_INTR_AUTH_PASS_INTR_Msk   0x1UL
#define BLE_BLESS_ENC_INTR_ECB_PROC_INTR_Pos    1UL
#define BLE_BLESS_ENC_INTR_ECB_PROC_INTR_Msk    0x2UL
#define BLE_BLESS_ENC_INTR_CCM_PROC_INTR_Pos    2UL
#define BLE_BLESS_ENC_INTR_CCM_PROC_INTR_Msk    0x4UL
#define BLE_BLESS_ENC_INTR_IN_DATA_CLEAR_Pos    3UL
#define BLE_BLESS_ENC_INTR_IN_DATA_CLEAR_Msk    0x8UL
/* BLE_BLESS.B1_DATA_REG */
#define BLE_BLESS_B1_DATA_REG_B1_DATA_Pos       0UL
#define BLE_BLESS_B1_DATA_REG_B1_DATA_Msk       0xFFFFFFFFUL
/* BLE_BLESS.ENC_MEM_BASE_ADDR */
#define BLE_BLESS_ENC_MEM_BASE_ADDR_ENC_MEM_Pos 0UL
#define BLE_BLESS_ENC_MEM_BASE_ADDR_ENC_MEM_Msk 0xFFFFFFFFUL
/* BLE_BLESS.TRIM_LDO_0 */
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_VREG_Pos   0UL
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_VREG_Msk   0xFUL
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_ITAIL_Pos  4UL
#define BLE_BLESS_TRIM_LDO_0_ACT_LDO_ITAIL_Msk  0xF0UL
/* BLE_BLESS.TRIM_LDO_1 */
#define BLE_BLESS_TRIM_LDO_1_ACT_REF_BGR_Pos    0UL
#define BLE_BLESS_TRIM_LDO_1_ACT_REF_BGR_Msk    0xFUL
#define BLE_BLESS_TRIM_LDO_1_SB_BGRES_Pos       4UL
#define BLE_BLESS_TRIM_LDO_1_SB_BGRES_Msk       0xF0UL
/* BLE_BLESS.TRIM_LDO_2 */
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_RES_Pos   0UL
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_RES_Msk   0x1FUL
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_NBIAS_Pos 5UL
#define BLE_BLESS_TRIM_LDO_2_SB_BMULT_NBIAS_Msk 0x60UL
/* BLE_BLESS.TRIM_LDO_3 */
#define BLE_BLESS_TRIM_LDO_3_LVDET_Pos          0UL
#define BLE_BLESS_TRIM_LDO_3_LVDET_Msk          0x1FUL
#define BLE_BLESS_TRIM_LDO_3_SLOPE_SB_BMULT_Pos 5UL
#define BLE_BLESS_TRIM_LDO_3_SLOPE_SB_BMULT_Msk 0x60UL
/* BLE_BLESS.TRIM_MXD */
#define BLE_BLESS_TRIM_MXD_MXD_TRIM_BITS_Pos    0UL
#define BLE_BLESS_TRIM_MXD_MXD_TRIM_BITS_Msk    0xFFUL
/* BLE_BLESS.TRIM_LDO_4 */
#define BLE_BLESS_TRIM_LDO_4_T_LDO_Pos          0UL
#define BLE_BLESS_TRIM_LDO_4_T_LDO_Msk          0xFFUL
/* BLE_BLESS.TRIM_LDO_5 */
#define BLE_BLESS_TRIM_LDO_5_RESERVED_Pos       0UL
#define BLE_BLESS_TRIM_LDO_5_RESERVED_Msk       0xFFUL


#endif /* _CYIP_BLE_H_ */


/* [] END OF FILE */
